/********************************************************************************
**
** 文件名:     leelen_file.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现文件传输相关通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_FILE_H
#define LEELEN_FILE_H

#ifdef __cplusplus
extern "C" {
#endif


/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t       dir_namelen;        /* 路径名称长度 */
    uint8_t       *dir_name;          /* 路径名称 */
    uint8_t       file_namelen;       /* 文件名称长度 */
    uint8_t       *file_name;         /* 文件名称 */
} file_path_t;

typedef struct {
    uint8_t       file_namelen;       /* 文件名称长度 */
    uint8_t       file_name[60];      /* 文件名称 */
    uint8_t       file_attrib;        /* 文件属性 */
    uint32_t      file_length;        /* 文件长度 */ 
} file_info_t;

/*******************************************************************
** 函数名:     start_file_0x0401
** 函数描述:   文件删除
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]path：    文件路径信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0401(addr_info_t *addr, file_path_t *path, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0401
** 函数描述:   停止文件删除
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0401(void);

/*******************************************************************
** 函数名:     start_file_0x0402
** 函数描述:   获取某路径下的文件列表
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]offset：  文件起始值
**             [in]path：    文件路径信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0402(addr_info_t *addr, int offset, file_path_t *path, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0402
** 函数描述:   停止获取某路径下的文件列表
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0402(void);

/*******************************************************************
** 函数名:     start_file_0x0403
** 函数描述:   创建目录
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]path：    文件路径信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0403(addr_info_t *addr, file_path_t *path, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0403
** 函数描述:   停止创建目录
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0403(void);

/*******************************************************************
** 函数名:     start_file_0x0404
** 函数描述:   重命名文件夹/文件
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]attrib：  文件目录夹或文件
**             [in]old：     旧文件路径信息
**             [in]new：     新文件名
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0404(addr_info_t *addr, uint8_t attrib, file_path_t *old, name_t *new_name, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0404
** 函数描述:   停止重命名文件/目录
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0404(void);

/*******************************************************************
** 函数名:     start_file_0x0405
** 函数描述:   文件上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]path：    文件路径信息
**             [in]length：  文件大小
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0405(addr_info_t *addr, file_path_t *path, int length, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0405
** 函数描述:   停止文件上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0405(void);

/*******************************************************************
** 函数名:     start_file_0x0406
** 函数描述:   文件下载
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]path：    文件路径信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_file_0x0406(addr_info_t *addr, file_path_t *path, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_file_0x0406
** 函数描述:   停止文件下载
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_file_0x0406(void);

/*******************************************************************
** 函数名:     init_file
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_file(void);


#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_FILE_H */

