/********************************************************************************
**
** 文件名:     leelen_system.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现系统及相关通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_SYSTEM_H
#define LEELEN_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif


/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t       device_type;            /* 异常设备类型 */
    uint8_t       device_num[5];          /* 异常设备号码 */
    uint8_t       device_alarm;           /* 报警类型 */
    uint8_t       device_len;             /* 异常设备地址长度 */
    uint8_t       *device_name;           /* 异常设备地址信息 */
} device_record_t;

typedef struct {
    uint8_t       title_len;              /* 信息标题长度 */
    uint8_t       *title;                 /* 信息标题 */
    uint32_t      content_len;            /* 信息内容长度 */
    uint8_t       *content;               /* 信息内容 */
} info_t;

typedef struct {
    uint8_t       type;                   /* 附件类型 */
    uint8_t       file_len;               /* 附件名称长度 */
    uint8_t       *file;                  /* 附件名称 */
    uint32_t      length;                 /* 附件长度 */
} attachment_t;


/*******************************************************************
** 函数名:     start_system_0x0501
** 函数描述:   协议探测
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_system_0x0501(addr_info_t *addr, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_system_0x0501
** 函数描述:   停止协议探测
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_system_0x0501(void);

/*******************************************************************
** 函数名:     start_system_0x0502
** 函数描述:   时间同步
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_system_0x0502(addr_info_t *addr, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_system_0x0502
** 函数描述:   停止时间同步
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_system_0x0502(void);

/*******************************************************************
** 函数名:     start_system_0x0503
** 函数描述:   设备异常报警上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]device：  异常设备信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_system_0x0503(addr_info_t *addr, device_record_t *device, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_system_0x0503
** 函数描述:   停止设备异常报警上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_system_0x0503(void);

/*******************************************************************
** 函数名:     start_system_0x0504
** 函数描述:   信息发送
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]info：    信息标题内容
**             [in]num：     附件数量
**             [in]attach:   附件信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_system_0x0504(addr_info_t *addr, info_t *info, uint8_t num, attachment_t *attach, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_system_0x0504
** 函数描述:   停止信息发送
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_system_0x0504(void);

/*******************************************************************
** 函数名:     init_system
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_system(void);


#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_SYSTEM_H */

