/********************************************************************************
**
** 文件名:     leelen_lift.c
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现梯控通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_LIFT_H
#define LEELEN_LIFT_H

#ifdef __cplusplus
extern "C" {
#endif

/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t  src_floor[5];            /* 电梯起始楼层用户信息 */
    uint8_t  dest_floor[5];           /* 电梯目的楼层用户信息*/
} floor_info_t;

typedef struct {
    uint8_t   state;                   /* 电梯状态 */
    uint8_t   dir;                     /* 电梯方向信息*/
    int8_t    floor;                   /* 电梯楼层信息 */
} lift_info_t;


/*******************************************************************
** 函数名:     start_lift_0x0201
** 函数描述:   开始呼梯
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]dir:      方向信息
**             [in]floor:    起始楼层信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_lift_0x0201(addr_info_t *addr, uint8_t dir, floor_info_t *floor, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_lift_0x0201
** 函数描述:   停止呼梯
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_lift_0x0201(void);

/*******************************************************************
** 函数名:     start_lift_0x0202
** 函数描述:   户户互访梯控
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]floor:    楼层信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_lift_0x0202(addr_info_t *addr, floor_info_t *floor, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_lift_0x0202
** 函数描述:   停止户户互访梯控
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_lift_0x0202(void);

/*******************************************************************
** 函数名:     start_lift_0x0203
** 函数描述:   刷卡梯控
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]floor:    楼层信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_lift_0x0203(addr_info_t *addr, floor_info_t *floor, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_lift_0x0203
** 函数描述:   停止刷卡梯控
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_lift_0x0203(void);

/*******************************************************************
** 函数名:     start_lift_0x0204
** 函数描述:   电梯状态查询
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_lift_0x0204(addr_info_t *addr, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_lift_0x0204
** 函数描述:   停止电梯状态查询
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_lift_0x0204(void);

/*******************************************************************
** 函数名:     init_lift
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_lift(void);




#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_LIFT_H */

