/********************************************************************************
**
** 文件名:     leelen_big.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现大数据通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_BIG_H
#define LEELEN_BIG_H

#ifdef __cplusplus
extern "C" {
#endif


/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t       dir_namelen;        /* 路径名称长度 */
    uint8_t       *dir_name;          /* 路径名称 */
    uint8_t       file_namelen;       /* 文件名称长度 */
    uint8_t       *file_name;         /* 文件名称 */
} big_file_t;


/*******************************************************************
** 函数名:     start_big_0x0601
** 函数描述:   大数据记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]type：    大数据类型
**             [in]file：    大数据路径信息
**             [in]len：     大数据大小
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_big_0x0601(addr_info_t *addr, uint8_t type, big_file_t *file, uint32_t len, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_big_0x0601
** 函数描述:   停止大数据记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_big_0x0601(void);

/*******************************************************************
** 函数名:     hdl_big_data_0x0601
** 函数描述:   请求协议的处理
** 参数:       [in]data:         接收到的数据；
**             [in]data_len：    接收到数据的长度
**             [in/out]ptk:      数据包参数  
** 返回:       1成功;2错误;3不支持;4内存不足;5终止传输
********************************************************************/
uint8_t hdl_big_data_0x0601(uint8_t *data, int data_len, big_packet_t *pkt);

/*******************************************************************
** 函数名:     init_big
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_big(void);


#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_BIG_H */

