/********************************************************************************
**
** 文件名:     leelen_card.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现门禁刷卡相关通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_CARD_H
#define LEELEN_CARD_H

#ifdef __cplusplus
extern "C" {
#endif

/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t       card_id[3];            /* 卡ID */
    uint8_t       card_usr[4];           /* 住户号码 */
    uint8_t       card_type;             /* 卡类型 */
    uint8_t       card_start[5];         /*  有效时间起点 */
    uint8_t       card_end[5];           /*  有效时间终点 */
} card_info_t;

typedef struct {
    uint8_t       card_id[3];            /* 卡ID */
    uint8_t       card_usr[4];           /* 用户名 */
    uint8_t       card_pos;              /* 刷卡点位置 */
    uint8_t       lock_state;            /* 锁状态 */
    uint8_t       open_reason;           /* 开门原因 */
} card_record_t;

typedef struct {
    uint8_t       card_id[3];            /* 卡ID */
    uint8_t       time[7];               /* 时间信息 */
    uint8_t       device[5];             /* 设备号 */
    uint8_t       card_pos;              /* 刷卡点位置 */
} card_patrol_t;


/*******************************************************************
** 函数名:     start_card_0x0101
** 函数描述:   开始下载单张卡
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]card：    卡信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0101(addr_info_t *addr, card_info_t *card, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0101
** 函数描述:   停止下载单张卡
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0101(void);

/*******************************************************************
** 函数名:     start_card_0x0102
** 函数描述:   删除单张卡
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]card：    卡信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0102(addr_info_t *addr, card_info_t *card, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0102
** 函数描述:   停止删除单张卡
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0102(void);
 
/*******************************************************************
** 函数名:     start_card_0x0103
** 函数描述:   删除某户全部卡
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]card：    卡信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0103(addr_info_t *addr, card_info_t *card, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0103
** 函数描述:   停止删除某户全部卡
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0103(void);
 
/*******************************************************************
** 函数名:     start_card_0x0104
** 函数描述:   删除某户全部保安卡
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0104(addr_info_t *addr, void (*informer)(RESULT_E));
 
/*******************************************************************
** 函数名:     stop_card_0x0104
** 函数描述:   停止删除全部保安卡
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0104(void);
 
/*******************************************************************
** 函数名:     start_card_0x0105
** 函数描述:   删除主机所有卡
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0105(addr_info_t *addr, void (*informer)(RESULT_E));
 
/*******************************************************************
** 函数名:     stop_card_0x0105
** 函数描述:   删除主机所有卡
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0105(void);
 
/*******************************************************************
** 函数名:     start_card_0x0106
** 函数描述:   刷卡记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]rec：     刷卡记录
**             [in]pic_num： 图片数量
**             [in]pic：     图片信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0106(addr_info_t *addr, card_record_t *rec, uint8_t pic_num, name_t *pic, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0106
** 函数描述:   停止刷卡记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0106(void);

/*******************************************************************
** 函数名:     start_card_0x0107
** 函数描述:   密码开锁记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]rec：     刷卡记录
**             [in]pic_num： 图片数量
**             [in]pic：     图片信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0107(addr_info_t *addr, card_record_t *rec, uint8_t pic_num, name_t *pic, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0107
** 函数描述:   停止密码开锁记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0107(void);

/*******************************************************************
** 函数名:     start_card_0x0108
** 函数描述:   门状态信息记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]rec：     刷卡记录
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0108(addr_info_t *addr, card_record_t *rec, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0108
** 函数描述:   停止门状态信息记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0108(void);

/*******************************************************************
** 函数名:     start_card_0x0109
** 函数描述:   远程开锁
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]rec：     刷卡记录
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0109(addr_info_t *addr, card_record_t *rec, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0109
** 函数描述:   停止门状态信息记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0109(void);

/*******************************************************************
** 函数名:     start_card_0x0110
** 函数描述:   巡更卡刷卡记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]rec：     巡更刷卡记录
**             [in]pic_num： 图片数量
**             [in]pic：     图片信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_card_0x0110(addr_info_t *addr, card_patrol_t *rec, uint8_t pic_num, name_t *pic, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_card_0x0110
** 函数描述:   停止巡更卡刷卡记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_card_0x0110(void);

/*******************************************************************
** 函数名:     init_card
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_card(void);



#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_CARD_H */

