/********************************************************************************
**
** 文件名:     leelen_protocol.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_PROTOCOL_H
#define LEELEN_PROTOCOL_H

#ifdef __cplusplus
extern "C" {
#endif



/*
********************************************************************************
* 定义status
********************************************************************************
*/
#define STS_RUNNING     0x80              /* 运行状态 */


/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint8_t   status;                    /* 状态 */
    void      (*informer)(RESULT_E);     /* 回调通知函数 */ 
} protoco_send_t;


typedef struct {
    uint8_t   *loc_usr;                  /* 本机用户 */
    uint8_t   *loc_ip;                   /* 本机IP   */
    uint8_t   *rem_usr;                  /* 对方用户 */
    uint8_t   *rem_ip;                   /* 本机IP   */
} addr_info_t;


typedef struct {
    uint8_t       name_len;              /* 名称长度 */
    uint8_t       *name;                 /* 名称 */
} name_t;


/*
********************************************************************************
* 定义枚举结构
********************************************************************************
*/
typedef enum
{
    UDP_CALLBACK_REMOTE_SET_SECURITY = 0x453a0002,
    UDP_CALLBACK_INFO = 0X453A0504
}UDP_CALLBACK_E;

typedef void (*udp_callback)(UDP_CALLBACK_E,unsigned long);
/*******************************************************************
** 函数名:     get_version
** 函数描述:   版本号,用于协议探测
** 参数:       无
** 返回:       无
********************************************************************/
uint8_t* get_version(void);

/*******************************************************************
** 函数名:     init_protocol
** 函数描述:   模块初始化函数
** 参数:       [in] ver:  系统版本号,用于协议探测
**            [in]callback：回调通知函数
** 返回:       无
********************************************************************/
void init_protocol(char *version,udp_callback callback);

/*******************************************************************
** 函数名:     uninit_protocol
** 函数描述:   模块去始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void uninit_protocol(void);

#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_PROTOCOL_H */

