/********************************************************************************
**
** 文件名:     leelen_talk.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现对讲相关通讯协议功能
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/

#ifndef LEELEN_TALK_H
#define LEELEN_TALK_H

#ifdef __cplusplus
extern "C" {
#endif


/*
********************************************************************************
* 定义数据结构
********************************************************************************
*/
typedef struct {
    uint16_t      length;            /* 通话时长 */
    uint8_t       answer;            /* 是否接听 */
    uint8_t       unlock;            /* 是否开锁 */
    uint8_t       message;           /* 是否留言 */
} talk_record_t;



/*******************************************************************
** 函数名:     start_talk_0x0301
** 函数描述:   呼叫记录上传
** 参数:       [in]addr:     目标地址、源地址信息
**             [in]fromto：  主叫、被叫地址
**             [in]rec：     对讲记录
**             [in]pic_num： 图片数量
**             [in]pic：     图片信息
**             [in]informer：回调通知函数
** 返回:       处理成功true，失败false
********************************************************************/
bool_t start_talk_0x0301(addr_info_t *addr, addr_info_t *fromto, talk_record_t *rec, uint8_t pic_num, name_t *pic, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     stop_talk_0x0301
** 函数描述:   停止呼叫记录上传
** 参数:       无
** 返回:       无
** 注意:
********************************************************************/
bool_t stop_talk_0x0301(void);

/*******************************************************************
** 函数名:     init_talk
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_talk(void);


#ifdef __cplusplus
}
#endif

#endif          /* end of LEELEN_TALK_H */

