/********************************************************************************
**
** 文件名:     leelen_big_packet.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现通讯协议大数据包分配管理模块
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/


#ifndef LEELEN_BIG_PLEE_ACKET_H
#define LEELEN_BIG_PLEE_ACKET_H

#ifdef __cplusplus
extern "C" {
#endif



/*
********************************************************************************
* 定义BIG PLEE_ACKET
********************************************************************************
*/
typedef struct {
    uint8_t   sync_head[3];       /* 同步头数据 */
    uint16_t  prot_ver;           /* 协议版本号 */
    uint16_t  cmd_type;           /* 命令字 */
    uint32_t  session_id;         /* 会话ID */
    uint8_t   req_ack;            /* 请求/应答 */
    uint8_t   encrypt;            /* 加密 */
    uint32_t  pkt_length;         /* 包体数据长度 */
    uint8_t   src[5];             /* 源地址 */
    uint8_t   dest[5];            /* 目的地址 */
    uint8_t   data_type;          /* 数据类型 */
    uint8_t   dir_namelen;        /* 目录名称长度 */
    uint8_t   dir_name[60];       /* 目录名称 */
    uint8_t   file_namelen;       /* 文件名称长度 */
    uint8_t   file_name[60];      /* 文件名称 */
    uint32_t  file_length;        /* 数据总长度 */
    uint32_t  total_pkt;          /* 包数量 */
    uint32_t  cur_pktid;          /* 当前包序号 */
    uint32_t  cur_size;           /* 本包发送数据长度 */
    uint16_t  reserved;           /* 预留 */
    uint32_t  dest_ip;            /* 目的IP */
    uint32_t  dest_port;          /* 端口 */
    uint8_t   check_sum;          /* 校验字 */
} big_packet_t;


/*******************************************************************
** 函数名:     big_packet_head_length
** 函数描述:   获取包头长度(包括累加和预留字节 3个字节)
** 参数:       [in]  pkt:       数据包
** 返回:       包头数据长度
********************************************************************/
uint8_t big_packet_head_length(big_packet_t *pkt);

/*******************************************************************
** 函数名:     big_packet_assemble
** 函数描述:   根据协议进行组帧
** 参数:       [in]  pkt:       数据包
**             [in]  cmd:       协议命令字
**             [in]  sid:       会话id
**             [in]  len:       包长度
** 返回:       无
********************************************************************/
void big_packet_assemble(big_packet_t *pkt, uint16_t cmd, uint32_t sid, uint32_t len);

/*******************************************************************
** 函数名:     big_packet_alloc
** 函数描述:   请求分配一个数据包
** 参数:       [in]  len:       请求分配数据包的大小
** 返回:       分配到的数据包; 如分配失败, 则返回0
********************************************************************/
big_packet_t *big_packet_alloc(void);

/*******************************************************************
** 函数名:     big_packet_free
** 函数描述:   释放分配到的数据包
** 参数:       [in]  pkt:       待释放的数据包
** 返回:       释放成功或失败
********************************************************************/
void big_packet_free(big_packet_t *pkt);


#ifdef __cplusplus
}
#endif


#endif          /* end of LEELEN_BIG_PLEE_ACKET_H */

