/********************************************************************************
**
** 文件名:     leelen_big_udp.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现通讯协议大数据UDP发送
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/




#ifndef LEELEN_BIG_UDP_H
#define LEELEN_BIG_UDP_H

#ifdef __cplusplus
extern "C" {
#endif


/*******************************************************************
** 原型名:     big_informer
** 原型描述:   数据包发送结果通知函数
** 参数:       [in]  result:            发送结果
**             [in]  ackcode:           socket错误码
** 返回:       无
********************************************************************/
typedef void    (* big_informer)(SOCK_RESULT_E result, int ackcode);

/*******************************************************************
** 函数名:     udp_big_sending
** 函数描述:   查询udp是否在发送数据
** 参数:       无
** 返回:       无
********************************************************************/
bool_t udp_big_sending(void);

/*******************************************************************
** 函数名:     udp_big_reset
** 函数描述:   复位socket, 将已打开的socket关闭掉 
** 参数:       无
** 返回:       无
********************************************************************/
void udp_big_reset(void);

/*******************************************************************
** 函数名:     udp_big_stopsend
** 函数描述:   停止继续发送
** 参数:       无
** 返回:       无
********************************************************************/
void udp_big_stopsend(void);

/*******************************************************************
** 函数名:     udp_big_send
** 函数描述:   请求发送数据包
** 参数:       [in]  pkt:             发送数据包
**             [in]  big_informer:    回调通知函数
** 返回:       true--成功;  false--失败;
********************************************************************/
bool_t udp_big_send(big_packet_t *pkt, void (* big_informer)(SOCK_RESULT_E result, int ackcode));

/*******************************************************************
** 函数名:     init_big_udp
** 函数描述:   模块初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_big_udp(void);

/*******************************************************************
** 函数名:     uninit_big_udp
** 函数描述:   模块去始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void uninit_big_udp(void);


#ifdef __cplusplus
}
#endif


#endif          /* end of LEELEN_BIG_UDP_H */

