/********************************************************************************
**
** 文件名:     leelen_send_list.h
** 版权所有:   (c) 2015 厦门立林科技有限公司
** 文件描述:   实现通讯协议数据缓冲发送队列
**
*********************************************************************************
**             修改历史记录
**===============================================================================
**| 日期       | 作者   |  修改记录
**===============================================================================
**| 2015/09/28 | zzh    |  创建该文件
**
*********************************************************************************/



#ifndef LEELEN_SEND_LIST_H
#define LEELEN_SEND_LIST_H

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************
** 函数名:     apply_send_list
** 函数描述:   请求发送协议数据
** 参数:       [in]  keyword:       请求发送的数据包关键字, 通常填充协议命令字
**             [in]  pkt:           待发送的数据包
**             [in]  over_time:     指定发送超时时间(单位:秒)
**             [in]  max_send:      在接收不到应答情况下的最大传送次数
**             [in]  informer:      发送结果回调函数
** 返回:       如请求失败, 则返回false;  成功, 则返回一个不为0的标识
** 注意:       1. 数据包pkt会在本模块内部进行释放, 一旦调用了该接口, 无论成功或失败, 调用者都无需释放pkt;
**             2. 如over_time为0, 则表示采用缺省超时时间(即15秒)
**             3. 如max_send为0, 则表示采用缺省发送次数(即3次);
********************************************************************/
bool_t apply_send_list(uint16_t keyword, packet_t *pkt, uint8_t over_time, uint8_t max_send, void (*informer)(RESULT_E));

/*******************************************************************
** 函数名:     cancel_send_list
** 函数描述:   删除发送链表中的指定节点
** 参数:       [in]  keyword:    删除命令字
** 返回:       无
********************************************************************/
void cancel_send_list(uint16_t keyword);

/*******************************************************************
** 函数名:     init_send_list
** 函数描述:   初始化函数
** 参数:       无
** 返回:       无
********************************************************************/
void init_send_list(void);

#ifdef __cplusplus
}
#endif


#endif      /* end of LEELEN_SEND_LIST_H */

